app/Models/SelectItem.php

    public function insert_data($data = array())
    {
        $this->db->table($this->table)->insert($data);
---
INSERT INTO `selectitems` (`select_item`, `select_item_parent_id`) VALUES ('sub sub sub sub sub sub sub A1-1-1-1-1-1-1', '52')

    public function get_child_items($parent_id)
    {
        $query = $this->builder->where('select_item_parent_id',$parent_id)->get();
---
SELECT *
FROM `selectitems`
WHERE `select_item_parent_id` = '52'

    public function create_child_items($id)
    {
        $no_of_children = 2;
        $parent = $this->builder->where('id',$id)->get()->getResult();
---
SELECT *
FROM `selectitems`
WHERE `id` = '52'